confirm("Киця!!! Шо ти? Акєй?");
alert("Ти ж виходить на 8 березня їдеш до Львову?");
alert("То виходить шо ПОДАРУНОК я тобі не подарую? АХАХ,");
alert(" У мене Є пропозиція....");
alert("ГОТОВА?");
alert("А давай я тобі скину на гроші на КАРТУ, замість тисячі роз?");
alert("Питання в тому скількО? )))");

let user;
let sum = 5001;
user = prompt(" Давай, напиши свою цифру.... чекаю...");

while (user > sum) {
    user = prompt("ОГООО, НУ МАЙ СОВІСТЬ! Давай ще разок, СІКО?");
    user = prompt("Ну РІЛІ це  дофіга, Ще раз?");
    user = prompt("Блін ти мене в могилу зведеш. Давай ще меньше...");
    user = prompt("Я СТІКО НЕ ЗАРОБЛЯЮ!");
    user = prompt("Ясно Понятно.... цифра з трьома ноликами... ОКЕЙ?");
    user = prompt("Всьо ПРИЄХАЛІ..... меееньшееееее.......");
} alert("Акєй я можу собі це дозволити, напишеш скіко ти ввела? бо я ще не вмію збирати данні");

