// Задача 1:

/* console.log ("Hello world");

let num1 =prompt("перше число");
let num2 =prompt("друге число");

let rem =num1 % num2;
let pow = (num1, num2);

console.log(num1);
console.log(num2);
console.log(rem);
console.log(pow); */

// Задача 2:

/* let num = 10; */

// += -= = /= %= **= - скорочені оператори присвоювання
/* Далі, використовуючи скорочену форму із присвоюванням виконайте наступні дії:
Додайте до цього числа 5
Відніміть від цього числа 2
Помножте число на 2 */

/* num +=5;
num -=2;
num *=2;
++num;
++num;
++num;
num + 5 - (2 *2);    */

/* 3.Збільшіть число на 3 використовуючи
тільки оператор інкременту. */
// ++ -- інкремент та декремент збільшення та зменшення на 1.
// num +=3; 
// (не зміг використати ++)
// console.log(num);  

// Задача 3:
/* Напишіть у консолі 3 вирази з оператором 
залишок від ділення (%). */

/* console.log(10 % 2)
console.log(10 % 3)
console.log(10 % 4) */

// Задача 4
/* Напишіть програму яка питає вік користувача через prompt.
І виводить true у консолі якщо результат більше або дорівнює 18,
або false якщо менше ніж 18.
Оператор більше або дорівнює виглядає так >= */

let age = prompt( 2+2 "скільки вам років?");
console.log(age);
if(age >= 18 ){
 console.log(true);
} else {
 console.log(false);
}

// Задача 5
/* 
let x = +prompt("кордината x..."); 
let y = +prompt("кордината y...");

console.log(x);
console.log(y); */